Testcases/SoapLibrary/XML/DivideRequest.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <Divide xmlns="http://tempuri.org/">
            <intA>[int]</intA>
            <intB>[int]</intB>
        </Divide>
    </Body>
</Envelope>