src/resources/API/SOAP/subtract.xml

<x:Envelope
    xmlns:x="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:tem="http://tempuri.org/">
    <x:Header/>
    <x:Body>
        <tem:Subtract>
            <tem:intA>{number1}</tem:intA>
            <tem:intB>{number2}</tem:intB>
        </tem:Subtract>
    </x:Body>
</x:Envelope>