Testcases/SoapLibrary/XML/SubtractRequest.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <Subtract xmlns="http://tempuri.org/">
            <intA>[int]</intA>
            <intB>[int]</intB>
        </Subtract>
    </Body>
</Envelope>